app/controllers/api/v1/articles_controller.rb

    def show
      @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

    def create
        user_id = session[:user_id]
        create_article = ->{
            @article = Article.create(article_params) do |u|
---
INSERT INTO `articles` (`title`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('Title', 'Description', 1, '2019-10-07 14:07:46', '2019-10-07 14:07:46')