app/controllers/api/v1/users_controller.rb

INSERT INTO `users` (`email`, `age`, `lastName`, `created_at`, `updated_at`) VALUES ('rob@mail.com', 22, 'Aslanyan', '2019-10-07 11:35:58', '2019-10-07 11:35:58')
---
    def create
        @user = User.create(users_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `firstName` = 'Robert', `age` = 24, `updated_at` = '2019-10-07 12:30:43' WHERE `users`.`id` = 1
---
    def update
        user_id = session[:user_id]
        update_user = ->{
            @user = User.find(params[:id])
            @user.update(users_params)